import { Timeline, Tag } from "antd";
import "../stylus/timePlay.styl";

function TimePlay() {
  return (
    <div style={{ "overflow-y": "hidden" }}>
      <Timeline className="page-container" mode="left">
        <Timeline.Item label="2021-02-06 04:20:00">
          <h4>
            <Tag color="#f50">最新</Tag>法国新增新冠肺炎确诊病例22139例 累计确诊3296747例
          </h4>
          <p>
            当地时间2月5日，法国公共卫生部门公布的数据显示，截至当天下午，法国累计确诊新冠肺炎病例3296747例，较前一日新增22139例。累计报告死亡病例78603例。
            截至5日，共有27614名患者住院接受治疗，其中3245名患者接受重症监护。法国当前新冠病毒检测呈阳性的比率为6.6%。数据显示，法国医院新冠肺炎重症患者床位占用率达到64%，相比4日小幅回落。
          </p>
          <span className="footer-chip">央视新闻</span>
        </Timeline.Item>
        <Timeline.Item label="2021-02-06 03:40:00">
          <h4>西班牙新增新冠肺炎确诊病例11073例 累计确诊2941990例</h4>
          <p>
            当地时间2月5日，西班牙卫生部发布的最新官方数据显示，过去24小时该国新增新冠肺炎确诊病例11073例，累计确诊2941990例；过去7天新增死亡病例1951例，累计死亡61386例。
          </p>
          <span className="footer-chip">央视新闻</span>
        </Timeline.Item>
        <Timeline.Item label="2021-02-06 02:15:00">
          <h4>世卫组织：全球新冠肺炎确诊病例超1亿437万例</h4>
          <p>
            根据世卫组织最新实时统计数据，截至欧洲中部时间2月5日17时（北京时间2月6日0时），全球累计新冠肺炎确诊病例104370550例，累计死亡病例2271180例。2月5日全球新冠肺炎确诊病例新增355041例，死亡病例新增10422例。
          </p>
          <span className="footer-chip">央视新闻</span>
        </Timeline.Item>
        <Timeline.Item label="2021-02-06 02:15:00">
          <h4>世卫组织：全球新冠肺炎确诊病例超1亿437万例</h4>
          <p>
            根据世卫组织最新实时统计数据，截至欧洲中部时间2月5日17时（北京时间2月6日0时），全球累计新冠肺炎确诊病例104370550例，累计死亡病例2271180例。2月5日全球新冠肺炎确诊病例新增355041例，死亡病例新增10422例。
          </p>
          <span className="footer-chip">央视新闻</span>
        </Timeline.Item>
        <Timeline.Item label="2021-02-06 02:15:00">
          <h4>世卫组织：全球新冠肺炎确诊病例超1亿437万例</h4>
          <p>
            根据世卫组织最新实时统计数据，截至欧洲中部时间2月5日17时（北京时间2月6日0时），全球累计新冠肺炎确诊病例104370550例，累计死亡病例2271180例。2月5日全球新冠肺炎确诊病例新增355041例，死亡病例新增10422例。
          </p>
          <span className="footer-chip">央视新闻</span>
        </Timeline.Item>
        <Timeline.Item label="2021-02-06 02:15:00">
          <h4>世卫组织：全球新冠肺炎确诊病例超1亿437万例</h4>
          <p>
            根据世卫组织最新实时统计数据，截至欧洲中部时间2月5日17时（北京时间2月6日0时），全球累计新冠肺炎确诊病例104370550例，累计死亡病例2271180例。2月5日全球新冠肺炎确诊病例新增355041例，死亡病例新增10422例。
          </p>
          <span className="footer-chip">央视新闻</span>
        </Timeline.Item>
        <Timeline.Item label="2021-02-06 02:15:00">
          <h4>世卫组织：全球新冠肺炎确诊病例超1亿437万例</h4>
          <p>
            根据世卫组织最新实时统计数据，截至欧洲中部时间2月5日17时（北京时间2月6日0时），全球累计新冠肺炎确诊病例104370550例，累计死亡病例2271180例。2月5日全球新冠肺炎确诊病例新增355041例，死亡病例新增10422例。
          </p>
          <span className="footer-chip">央视新闻</span>
        </Timeline.Item>
      </Timeline>
    </div>
  );
}

export default TimePlay;
